[
  "To the sandy beach of sea-coast Aulis I came after a voyage through the tides of Euripus, leaving Chalcis on its narrow firth, my city which feedeth the waters of far-famed Arethusa near the sea, that I might behold the army of the Achaeans and the ships rowed by those god-like heroes.",
  "For our husbands tell us that fair-haired Menelaus and high-born Agamemnon are leading them to Troy on a thousand ships in quest of the lady Helen, whom herdsman Paris carried off from the banks of reedy Eurotas-his guerdon from Aphrodite, when that queen of Cyprus entered beauty's lists with Hera and Pallas at the gushing fount.",
  "Through the grove of-Artemis, rich with sacrifice, I sped my course, the red blush mantling on my cheeks from maiden modesty, in my eagerness to see the soldiers' camp, the tents of the mail-clad Danai, and their gathered steeds.",
  "Two chieftains there I saw met together in council; one was Aias, son of Oileus; the other Aias, son of Telamon, crown of glory to the men of Salamis; and I saw Protesilaus and Palamedes, sprung from the son of Poseidon, sitting there amusing themselves with intricate figures at draughts.",
  "Diomedes too at his favourite sport of hurling quoits; and Meriones, the War-god's son, a marvel to mankind, stood at his side; likewise I beheld the offspring of Laertes, who came from his island hills, and with him Nireus, handsomest of all Achaeans.",
  "Achilles next, that nimble runner, swift on his feet as the wind, whom Thetis bore and Chiron trained; him I saw upon the beach, racing in full armour along the shingle and straining every nerve to beat a team of four horses, as he sped round the track on foot.",
  "And Eumelus, the grandson of Pheres, their driver, was shouting when I saw him. goading on his goodly steeds, with their bits of chased goldwork.",
  "Whereof the centre pair, that bore the yoke, had dappled coats picked out with white, while the trace-horses, on the outside, facing the turning-post in the course, were bays with spotted fetlocks.",
  "Close beside them Peleus' son leapt on his way, in all his harness, keeping abreast the rail by the axle-box.",
  "Next I sought the countless fleet, a wonder to behold, that I might fill my girlish eyes with gazing, a sweet delight.",
  "The warlike Myrmidons from Phthia held the right wing with fifty swift cruisers, upon whose sterns, right at the ends, stood Nereid goddesses in golden-effigy, the ensign of Achilles' armament.",
  "Near these were moored the Argive ships in equal numbers, o'er which Mecisteus' son, whom Taulaus his grandsire reared, and Sthenelus, son of Capaneus, were in command.",
  "Next in order, Theseus' son was stationed at the head of sixty ships from Attica, having the goddess Pallas set in a winged car drawn by steeds with solid hoof, a lucky sight for mariners.",
  "Then I saw Boeotia's fleet of fifty sails decked with ensigns; these had Cadmus at the stern holding a golden dragon at the beaks of the vessels, and earth-born Leitus was their admiral. ",
  "Likewise there were ships from Phocis; and from Locris came the son of Oileus with an equal contingent, leaving famed Thronium's citadel.",
  "And from Mycenae, the Cyclopes' town, Atreus' son sent a hundred wellmanned galleys",
  "His brother being with him in command, as friend with friend, that Hellas might exact on her, who had fled her home to wed a foreigner.",
  "Also I saw upon Gerenian Nestor's prows twelve from Pylos the sign of his neighbor Alpheus, four-footed like a bull.",
  "Moreover there was a squadron of Aenianian sail under King and next the lords of Elis, stationed near'-them, whom all the people named Epeians",
  "And Eurytus was lord of these; likewise he led the Taphian warriors with the white oar-blades",
  "The subjects of Meges, son of Phyleus, who had left the isles of the Echinades, where sailors cannot land.",
  "Lastly, Aias, reared in Salamis, was joining his right wing to the left of those near whom he was posted",
  "Closing the line with his outermost ships-twelve barques obedient to the helm-as I heard and then saw the crews",
  "No safe return shall he obtain, who bringeth his barbaric boats to grapple Aias.",
  "There I saw the naval armament, but some things I heard at home about the gathered host, whereof I still have a recollection."
]
